Конфигурации/DataProcessors/ПочтовоеУведомление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ПочтовоеУведомление</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>АдресаЭлПочты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Исполнители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурации/Documents/ДействиеПоЗадаче.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ДействиеПоЗадаче</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инициаторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Исполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Исполнители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеОкончаниеРаботПоСтатусу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийПоЗадаче</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееИзменениеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзмененияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботыВыполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасыДоФинала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПриоритетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРешение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРешения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЧТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПСС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВозвратовНаДоработку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПодготовкиЧТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТРЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРелиза</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интеграция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТРЗпоСтатусам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Исполнители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Часы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗанятоЧасовВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗанятостьВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЗанятоЧасовВМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурации/DataProcessors/ПочтовоеУведомление/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	Получатели = Новый Массив;
	Если Получатель <> ПустаяСсылкаСправочника("Инициаторы") 
		И Получатель <> ПустаяСсылкаСправочника("Исполнители") 
		И Получатель <> ПустаяСсылкаСправочника("Координаторы") Тогда		
			Получатели.Добавить(Получатель);
			ОтправитьПисьмоНаПочту(Получатели);
	Иначе
		Сообщить("Получатель не выбран. Для отправки сообщения выберите получателя"); 
		Возврат;
	КонецЕсли;
	//ОтправитьПочту();	
КонецПроцедуры

//
&НаКлиенте
Процедура ОтправитьПочту()
	
	ПроверкаПросрочки();
	
	Для каждого Строка Из Объект.АдресаЭлПочты Цикл
	
	Адрес = Строка.АдресЭлПочты;
	Тема = "Уведомление о задаче" ;
	ТекстПисьма = "Текст письма";
	
	Попытка
		Outlook = Новый COMОбъект("Outlook.Application");
		ЕстьОшибка = 0;
	Исключение
		ПоказатьПредупреждение(,"Не удалось создать объект Outlook.Application");
		ЕстьОшибка = 1;
	КонецПопытки;
	
	Если ЕстьОшибка = 0 Тогда
		
		Письмо = Outlook.CreateItem(0);
		
		Письмо.Subject = Тема;        // Тема
		Письмо.Recipients.Add(Адрес); // Адрес получателя
		
		Письмо.Display();  // важно перед манипуляцией с подписью вызвать, ибо не получится
		сПодписи = Письмо.HTMLBody;
		
		Письмо.HTMLBody        = ТекстПисьма; // Текст письма HTML
		
		Письмо.HTMLBody    = Письмо.HTMLBody + сПодписи; //подпись
		
		Outlook.ActiveWindow().WindowState = 1;  // выводить письмо на передний план
		Outlook.ActiveWindow().Activate();
		
	Иначе
		СтрокаЗапуска = "mailto:" + Адрес + "?subject=" + Тема + "&body=" + ТекстПисьма;
		ЗапуститьПриложение(СтрокаЗапуска);
	КонецЕсли;
	
	КонецЦикла; 
КонецПроцедуры

//
&НаСервере
Процедура ПроверкаПросрочки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДействиеПоЗадаче.Исполнитель.АдресЭлПочты КАК АдресЭлПочты,
	|	ДействиеПоЗадаче.Исполнитель,
	|	ДействиеПоЗадаче.Задача
	|ИЗ
	|	Документ.ДействиеПоЗадаче КАК ДействиеПоЗадаче
	
	|ГДЕ
	|	(РАЗНОСТЬДАТ(&ТекущаяДата, ДействиеПоЗадаче.СрокЧТЗ, ДЕНЬ) < 10
	|			ИЛИ РАЗНОСТЬДАТ(&ТекущаяДата, ДействиеПоЗадаче.СрокСдачиЗНИ, ДЕНЬ) < 10
	|			ИЛИ РАЗНОСТЬДАТ(&ТекущаяДата, ДействиеПоЗадаче.СрокДО, ДЕНЬ) < 10)";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    НоваяСтрока =  Объект.АдресаЭлПочты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);	
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере 
Функция ПустаяСсылкаСправочника(Наименование)
	Возврат Справочники[Наименование].ПустаяСсылка();
КонецФункции

&НаСервере
 Процедура ОтправитьПисьмоНаПочту(ПользователиПолучатели) Экспорт
	УчетнаяЗаписьЭП = Справочники.ПредопределенныеЭлементы.УчетнаяЗапись;
	ПарольУчетнойЗаписи = Справочники.ПредопределенныеЭлементы.ПарольУчетнойЗаписи;
	НаименованиеПрограммы = Справочники.ПредопределенныеЭлементы.НаименованиеПрограммы;
	СерверВходящейПочты = Справочники.ПредопределенныеЭлементы.АдресIMAP;
	СерверИсходящейПочты = Справочники.ПредопределенныеЭлементы.АдресSMTP;
	ПортСервераВходящейПочты = Справочники.ПредопределенныеЭлементы.ПортIMAP; 
	ПортСервераИсходящейПочты = Справочники.ПредопределенныеЭлементы.ПортSMTP;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераIMAP = СерверВходящейПочты.Значение;
	Профиль.АдресСервераSMTP = СерверИсходящейПочты.Значение;
	Профиль.ПортIMAP = 0;//ПортСервераВходящейПочты.Значение;
	Профиль.ПортSMTP = 0;//ПортСервераИсходящейПочты.Значение;
	Профиль.ПользовательIMAP = НаименованиеПрограммы.Значение;
	Профиль.ПарольIMAP = ПарольУчетнойЗаписи.Значение;
	Профиль.ПользовательSMTP= НаименованиеПрограммы.Значение;
	Профиль.ПарольSMTP = ПарольУчетнойЗаписи.Значение;
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
	
	Почта = Новый ИнтернетПочта;
	ТекстОшибки = "";
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Не удалось подключиться к серверу почты отправителя");
	КонецПопытки;
	
	
	Письмо = Новый ИнтернетПочтовоеСообщение; 
	ТемаПисьма = "";
	Письмо.Тема = НСтр("ru = '"+ТемаПисьма+"'");
	ТекстПисьма = ""; 
	Письмо.Тексты.Добавить( НСтр("ru = '"+ТекстПисьма+"'"));	
	Письмо.ИмяОтправителя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.ОтображаемоеИмя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.Адрес = УчетнаяЗаписьЭП.Значение;
	
	
	Для каждого ПользовательПолучатель Из ПользователиПолучатели Цикл
		Если ПользовательПолучатель.АдресЭлПочты = "" Тогда
			Сообщить("У получателя "+ПользовательПолучатель.Наименование+" не указана почта. Сообщение не будет отправлено "+ПользовательПолучатель.Наименование);
		Иначе 
			ПолучательПисьма = Письмо.Получатели.Добавить(ПользовательПолучатель.АдресЭлПочты);
			ПолучательПисьма.ОтображаемоеИмя = НСтр("ru = '"+ПользовательПолучатель.Наименование+"'");
		КонецЕсли;
	КонецЦикла;
	//Письмо.Вложения.Добавить(Файл);	
	
	
	Попытка
		Почта.Послать(Письмо);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Сообщить("Не удалось отправить письмо");
	КонецПопытки;
	
	
	Почта.Отключиться();
	Письмо.Вложения.Очистить();	
	ПисьмоОтправлено = Истина;
	
КонецПроцедуры
